EA/src/Catalogs/ОписателиТиповИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ОписателиТиповИнформационныхБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИнформационныеБазы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТипаУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Catalogs/ОписателиТиповИнформационныхБаз/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария( Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий" );
		
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторТипаПриИзменении(Элемент)
	
	Объект.ИдентификаторТипа = СокрЛП( ВРег( Объект.ИдентификаторТипа ) );
	Объект.ИдентификаторТипаУИД = ВычислитьУИДдляИдентификатораТипа( Объект.ИдентификаторТипа );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВычислитьУИДдляИдентификатораТипа( ИдентификаторТипа )
	
	Возврат Справочники.ОписателиТиповИнформационныхБаз.ВычислитьУИДдляИдентификатораТипа( ИдентификаторТипа );
	
КонецФункции
